In [4]:
import pandas as pd
titanic = pd.read_csv(r"C:\Users\polit\python_Pandas\titanic.csv")
titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

# 소문자 변형

In [6]:
titanic["Name"].str.lower() # 소문자로
titanic["Name"].str.upper() # 대문자로

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object

# 문자열 자르기

In [10]:
titanic['Name Splited'] = titanic["Name"].str.split(',')
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name Split,Name Splited
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,"[Braund, Mr. Owen Harris]","[Braund, Mr. Owen Harris]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,"[Cumings, Mrs. John Bradley (Florence Briggs ...","[Cumings, Mrs. John Bradley (Florence Briggs ..."
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"[Heikkinen, Miss. Laina]","[Heikkinen, Miss. Laina]"

In [12]:
# get(0) : 0번째 인덱스 가져오기
titanic['Surname'] = titanic['Name Splited'].str.get(0)
titanic['Surname']

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Surname, Length: 891, dtype: object

In [15]:
titanic['Name'].str.split(',').str.get(0)

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

# 문자열 매칭하기

In [16]:
titanic[titanic['Name'].str.contains('Countess')] # True인 값만 출력

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name Split,Name Splited,Surname
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5,B77,S,"[Rothes, the Countess. of (Lucy Noel Martha D...","[Rothes, the Countess. of (Lucy Noel Martha D...",Rothes

# 문자열 길이 계산히가

In [33]:
titanic['Name Lenth'] = titanic['Name'].str.len()
titanic['Name Lenth']

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name Lenth, Length: 891, dtype: int64

In [21]:
titanic[titanic['Name Lenth'] == titanic['Name Lenth'].max()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name Split,Name Splited,Surname,Name Lenth
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9,C65,C,"[Penasco y Castellana, Mrs. Victor de Satode ...","[Penasco y Castellana, Mrs. Victor de Satode ...",Penasco y Castellana,82

In [36]:
titanic['Name Lenth'].idxmax() # len이 가장 큰 index를 반환

titanic['Name'].str.len().idxmax() # 길이들을 다 구하고 그 중에 가장 큰 index를 반환

titanic.iloc[titanic['Name Lenth'].idxmax()]

PassengerId                                                   308
Survived                                                        1
Pclass                                                          1
Name            Penasco y Castellana, Mrs. Victor de Satode (M...
Sex                                                        female
Age                                                          17.0
SibSp                                                           1
Parch                                                           0
Ticket                                                   PC 17758
Fare                                                        108.9
Cabin                                                         C65
Embarked                                                        C
Name Split      [Penasco y Castellana,  Mrs. Victor de Satode ...
Name Splited    [Penasco y Castellana,  Mrs. Victor de Satode ...
Surname                                      Penasco y Castellana
Name Lenth                                                     82
Name: 307, dtype: object

In [38]:
titanic.loc[titanic['Name Lenth'].idxmax(), 'Name']

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'

In [ ]:
# 문자열 바꾸기

In [50]:
titanic['Sex'].replace({'male' : 'M', 'female' : 'F'})

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: Sex, Length: 891, dtype: object

In [51]:
titanic['Sex Short v1'] = titanic['Sex'].str.replace('female', 'F')
titanic['Sex Short v1'] = titanic['Sex'].str.replace('male', 'M')

titanic[['Sex','Sex Short v1']] 

# str.replace는 1대1 매칭이 아니라 female에 male이 들어가 있는 것 처럼 바꾸려는 문자가
# 포함되어 있으면 저렇게 오류가 발생함 

# Series에서 제공하는 .replace({key : value})는 1대1 매칭임.

        Sex Sex Short v1
0      male            M
1    female          feM
2    female          feM
3    female          feM
4      male            M
..      ...          ...
886    male            M
887  female          feM
888  female          feM
889    male            M
890    male            M

[891 rows x 2 columns]